Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParser
This API supports the Open API infrastructure and is not intended to be used directly from your code. Use the Tekla.Structures.Filtering.Filter class instead.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParser.#ctor
Initializes a new instance of the FilterExpressionParser class.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParser.Parse(System.String,System.IFormatProvider)
This API supports the Open API infrastructure and is not intended to be used directly from your code. Use the Tekla.Structures.Filtering.Filter class instead.
Parse a filter file and returns a Tekla.Structures.Filtering.FilterExpression object.
FullFileName: The filter file full name.
Provider: An object that supports the System.IFormatProvider interface to parse correctly numbers and dates according to the current culture info. If not provided
it uses the current CultureInfo.
Returns: A Tekla.Structures.Filtering.FilterExpression object.
Throws System.ArgumentNullException: Thrown when a null or empty FullFileName is specified.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParser.ParseExpressionString(System.String,System.IFormatProvider)
This API supports the Open API infrastructure and is not intended to be used directly from your code. Use the Tekla.Structures.Filtering.Filter class instead.
Parse a filter file and returns a Tekla.Structures.Filtering.FilterExpression object.
FilterString: The filter expression as a text string.
Provider: An object that supports the System.IFormatProvider interface to parse correctly numbers and dates according to the current culture info. If not provided
it uses the current CultureInfo.
Returns: A Tekla.Structures.Filtering.FilterExpression object.
Throws System.ArgumentNullException: Thrown when a null or empty FilterString is specified.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParser.FindDataFilterExpression``1(System.String)
Finds a Tekla.Structures.Filtering.DataFilterExpression derived object in the running assembly
and compare the default value to the input string.
A Tekla.Structures.Filtering.DataFilterExpression derived type.
InputString: The input string to compare.
Returns: A new instance of the Tekla.Structures.Filtering.DataFilterExpression derived class.
Throws System.NotSupportedException: Thrown when a the input string is not found.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParser.CountOccurrence(System.Collections.Generic.IEnumerable{System.Char},System.Char)
Counts the occurrence of a specific char in a string.
InputString: The input string to check.
InputChar: The input char to count.
Returns: The number of occurrence of a specific char.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParser.ParseString(System.String,System.IFormatProvider)
Parses the input FilterString.
Override this method to change the class behavior.
FilterString: The filter expression as a text string.
Provider: An object that supports the System.IFormatProvider interface to parse correctly numbers and dates according to the current culture info. If not provided
it uses the current CultureInfo.
Returns: A Tekla.Structures.Filtering.FilterExpression object.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParser.ParseBinaryFilterExpression(System.String,System.IFormatProvider)
Parses the input BinaryFilterExpressionString using the System.IFormatProvider.
Override this method to change the class behavior.
BinaryFilterExpressionString: The binary filter expression string.
Provider: An object that supports the System.IFormatProvider interface to parse correctly numbers and dates according to the current culture info.
Returns: A new Tekla.Structures.Filtering.FilterExpression object.
Throws System.NotSupportedException: Throws an System.NotSupportedException exception if the input binary filter expression string is not supported.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParser.GetBinaryFilterExpressionElements(System.String)
Gets the binary filter expression as array of tree elements.
The first represents the left operand, the second the Binary Operator, the third the Value.
Override this method to change the class behavior.
BinaryFilterExpressionString: The input binary filter expression string.
Returns: Returns an array of tree elements containing the two binary filter expression operand and one operator.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParser.ParseLeftOperand(System.String)
Parses the left operand of the binary filter expression returning a new instance of the Tekla.Structures.Filtering.DataFilterExpression derived object.
Override this method to change the class behavior.
BinaryFilterExpressionString: The binary filter expression string.
Returns: A new instance of the Tekla.Structures.Filtering.DataFilterExpression derived class representing the Left operand.
Throws Tekla.Structures.Filtering.FilterExpressionParserException: Throws an Tekla.Structures.Filtering.FilterExpressionParserException if the filter string contains errors.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParser.ParseStringConstantFilterExpression(System.String)
Parses a string returning a new Tekla.Structures.Filtering.StringConstantFilterExpression.
Override this method to change the class behavior.
StringConstantString: The input string to parse.
Returns: A new Tekla.Structures.Filtering.StringConstantFilterExpression.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParser.ParseStringOperatorType(System.String)
Parse a string returnin a Tekla.Structures.Filtering.StringOperatorType.
Override this method to change the class behavior.
StringOperatorTypeString: The input string to parse.
Returns: A Tekla.Structures.Filtering.StringOperatorType enum.
Throws System.NotSupportedException: Throws an System.NotSupportedException exception if the input string is not supported.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParser.ParseNumericConstantFilterExpression(System.String,System.IFormatProvider)
Parses a string returning a new Tekla.Structures.Filtering.NumericConstantFilterExpression.
Override this method to change the class behavior.
NumericConstantString: The input string to parse.
Provider: An object that supports the System.IFormatProvider interface to parse correctly numbers and dates according to the current culture info.
Returns: A new Tekla.Structures.Filtering.NumericConstantFilterExpression.
Throws System.ArgumentNullException: Thrown when a null or empty NumericConstantString is specified.
Throws System.NotSupportedException: Throws an System.NotSupportedException exception if the input string is not supported.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParser.ParseNumericOperatorType(System.String)
Parses a string returning a Tekla.Structures.Filtering.NumericOperatorType.
Override this method to change the class behavior.
NumericOperatorString: The input string to parse.
Returns: A Tekla.Structures.Filtering.NumericOperatorType enum.
Throws System.NotSupportedException: Throws an System.NotSupportedException exception if the input string is not supported.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParser.ParseDateTimeConstantFilterExpression(System.String,System.IFormatProvider)
Parses a string returning a new Tekla.Structures.Filtering.DateTimeConstantFilterExpression.
Override this method to change the class behavior.
DateTimeConstantString:
Provider: An object that supports the System.IFormatProvider interface to parse correctly numbers and dates according to the current culture info.
Returns: A new Tekla.Structures.Filtering.DateTimeConstantFilterExpression.
Throws System.ArgumentNullException: Thrown when a null or empty DateTimeConstantString is specified.
Throws System.NotSupportedException: Throws an System.NotSupportedException exception if the input string is not supported.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParser.ParseDateTimeOperatorType(System.String)
Parses a string returning a Tekla.Structures.Filtering.DateTimeOperatorType.
Override this method to change the class behavior.
DateTimeOperatorString: The input string to parse.
Returns: A Tekla.Structures.Filtering.DateTimeOperatorType enum.
Throws System.NotSupportedException: Throws an System.NotSupportedException exception if the input string is not supported.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParser.ParseBooleanConstantFilterExpression(System.String)
Parses a string returning a new Tekla.Structures.Filtering.BooleanConstantFilterExpression.
Override this method to change the class behavior.
BooleanConstantString: The input string to parse.
Returns: A new Tekla.Structures.Filtering.DateTimeConstantFilterExpression.
Throws System.NotSupportedException: Throws an System.NotSupportedException exception if the input string is not supported.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParser.ParseBooleanOperatorType(System.String)
Parses a string returning a Tekla.Structures.Filtering.BooleanOperatorType.
Override this method to change the class behavior.
BooleanOperatorTypeString: The input string to parse.
Returns: A Tekla.Structures.Filtering.BooleanOperatorType enum.
Throws System.NotSupportedException: Throws an System.NotSupportedException exception if the input string is not supported.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParser.Tokenizer(System.String)
Splits the current filter strings in multiple Tekla.Structures.TeklaStructuresInternal.Filtering.BinaryFilterExpressionToken.
Each token contains a single filter section or a collection of sub filters sections.
FilterString: The filter string to parse.
Returns: A list of Tekla.Structures.TeklaStructuresInternal.Filtering.BinaryFilterExpressionToken objects.
Throws Tekla.Structures.Filtering.FilterExpressionParserException: Throws an Tekla.Structures.Filtering.FilterExpressionParserException if the filter string contains errors.